src/toir_cf/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНалогообложенияНДС</name>
  <enumValues>
    <name>НалоговыйАгентПоНДС</name>
  </enumValues>
  <enumValues>
    <name>ПоФактическомуИспользованию</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНаЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНеОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяЕНВД</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортСырьевыхТоваровУслуг</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортНесырьевыхТоваров</name>
  </enumValues>
  <enumValues>
    <name>ВводОСВЭксплуатацию</name>
  </enumValues>
  <enumValues>
    <name>ОпределяетсяРаспределением</name>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДСУПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоСДЦ</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеУслуги</name>
  </enumValues>
  <enumValues>
    <name>РеализацияРаботУслугНаЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПродажаПоПатенту</name>
  </enumValues>
</mdclass:Enum>

src/toir_cf/src/CommonModules/УчетНДСКлиентСервер/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Применяемые типы налогообложения НДС
// 
// Параметры:
// 	Продажи - Булево -
// 	Закупки - Булево -
// Возвращаемое значение:
// 	СписокЗначений из ПеречислениеСсылка.ТипыНалогообложенияНДС -
//
Функция ПрименяемыеТипыНалогообложенияНДС() Экспорт
	
	ТипыНалогообложения = Новый СписокЗначений();
	
	Представление = НСтр("ru = 'Облагается НДС';
						 |en = 'Subject to VAT'");
	ТипыНалогообложения.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС"), Представление);
	
	Представление = НСтр("ru = 'Не облагается НДС';
						 |en = 'VAT-exempt'");
	
	ТипыНалогообложения.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС"), Представление);
	
	ТипыНалогообложения.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт"), НСтр("ru = 'Экспорт';
																							|en = 'Export'"));
	
	ТипыНалогообложения.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС"), НСтр("ru = 'Налоговый агент по НДС';
																							   |en = 'VAT tax agent'"));
	
	ТипыНалогообложения.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя"), НСтр("ru = 'Облагается НДС у покупателя';
																									|en = 'Subject to VAT at customer'"));
	Возврат ТипыНалогообложения;
	
КонецФункции

#КонецОбласти
